Revit 2027 API
Document.NewFascia Method
Creates a fascia.
Overload List
Name | Description
NewFascia(FasciaType, Reference) | Creates a fascia along a reference.
NewFascia(FasciaType, ReferenceArray) | Creates a fascia along a reference array.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace